zhou19830318/Doubao/sdkconfig.defaults
# AIWearable - Common SDK configuration defaults

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=n
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# Power management — enable CPU frequency scaling (160MHz → 80MHz when idle)
CONFIG_PM_ENABLE=y

# Heap
CONFIG_HEAP_ABORT_WHEN_ALLOCATION_FAILS=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Task watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# I2C
CONFIG_I2C_ISR_IRAM_SAFE=y

# LVGL (will be configured by board component)
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# LWIP socket pool (default 10 is too low for WS + HTTP + mDNS + STT)
CONFIG_LWIP_MAX_SOCKETS=16

# LVGL GIF support for state animations
CONFIG_LV_USE_GIF=y
CONFIG_LV_MEM_CUSTOM=y

# LVGL Filesystem support for reading GIF from SD card
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=83
CONFIG_LV_FS_STDIO_PATH="/sdcard/"
CONFIG_LV_FS_STDIO_CACHE_SIZE=512

# BiDi (RTL) support for Hebrew/Arabic text
CONFIG_LV_USE_BIDI=y

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# Main task stack (LVGL + MP3 + WebSocket processing need headroom)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# System event task stack (prevent overflow during WiFi events)
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Console on USB-SERIAL-JTAG (native USB on ESP32-S3, used by Waveshare Audio board)
# Input via USB-C, output to USB-C — idf.py monitor reads/writes this port natively
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# WebSocket / HTTP
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# mbedtls Optimization (required for DashScope WSS and MiMo HTTPS)
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# ESP-SR: WakeNet wake word detection
# Default model: "你好小智"
CONFIG_SR_WN_WN9_NIHAOXIAOZHI_TTS=y
# Disable MultiNet (not needed for wake word, saves ~3.8MB flash)
CONFIG_SR_MN_CN_NONE=y
CONFIG_SR_MN_EN_NONE=y
